#ifndef VERSIONS_H
#define VERSIONS_H

/*

Версия 0.2.2 :

  TODO:
  ! Добавить поиск сразу таблицей

Версия 0.2:

  ++ Учтены пожелания заказчика
  + Убрана memory leak

  TODO:
  ! Плохая проверка интернет-соединения
  ! Проверки на ошибки
  ! Добавить проверку того, что запись не найдена

Версия 0.1:

  + Отрефакторена загрузка файлов

Версия 0.0.9:

  * Работает основное выкачивание данных

  - Неоптимальный код
  - Серьезный memory leakage
  - Нет проверки на ошибки
  - Очень сырая версия

*/

#endif // VERSIONS_H
