#ifndef VERSIONS_H
#define VERSIONS_H

/*

Версия 0.3:

  + Подписаны столбцы в таблицах, добавлен UID
  ++ Дописан и исправлен поиск по фильтру zakupki
  + Добавлена выгрузка сводной таблицы о перечислении
  + Добавлены некоторые пункты в фильтр budget

  TODO:

  ! Пост-фильтр в закупках
  ! Выгрузка всех полей из zakupki
  ! Допилить сводную таблицу в budget
  ! Проверить работоспособность одиночного запроса в budget
  ! Добавить множественную проверку на дурака
  ! Добавить возможность останавливать неудачную операцию
  ! Сделать нормальные логи

Версия 0.2.2 :

  ++ Исправлены некоторые ошибки
  ++ Добавлена выгрузка базы budget
  ++ Добавлен примитивный поиск по фильтру budget

Версия 0.2:

  ++ Учтены пожелания заказчика
  + Убрана memory leak

  TODO:
  ! Плохая проверка интернет-соединения
  ! Проверки на ошибки
  ! Добавить проверку того, что запись не найдена

Версия 0.1:

  + Отрефакторена загрузка файлов

Версия 0.0.9:

  +++ Работает основное выкачивание данных

  - Неоптимальный код
  - Серьезный memory leakage
  - Нет проверки на ошибки
  - Очень сырая версия

*/

#endif // VERSIONS_H
